Repository: 84000/data-translation-memory
Catalog: toh173_84000-questions-on-selflessness.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བདག་མེད་པ་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Questions on Selflessness

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །དེ་ནས་དམིགས་པའི་ལྟ་བ་ཅན་རྣམ་པར་རྟོག་པ་དང་བཅས་ཤིང་རྣམ་པར་དཔྱོད་པ་དང་བཅས་པའི་མུ་སྟེགས་པ་དེ་དག་རྣམས་ཐེག་པ་ཆེན་པོའི་ནང་དུ་སོང་སྟེ།
en: Now, the tīrthikas—those who hold views based on objects and who engage in concepts and analysis—went among the followers of the Mahāyāna.

source: ཞེ་ས་དང་བཅས་ཤིང་ཐལ་མོ་སྦྱར་ནས་བདག་མེད་པའི་དྲི་བ་དག་ཡོངས་སུ་དྲིས་པ།
en: Respectfully, with joined palms, they asked these questions on selflessness:

source: རིགས་ཀྱི་བུ་ཐམས་ཅད་མཁྱེན་པས་ནི་ལུས་ལ་བདག་མེད་དོ་ཞེས་གསུངས་ལ།
en: “Sons of noble family, the Omniscient One taught that there is no self in the body.

source: གལ་ཏེ་ལུས་ལ་ཡང་དག་པར་བདག་མེད་ན་ཇི་ལྟར་ན་དེ་ལས་རྩེ་བ་དང་། དགོད་པ་དང་། ངུ་བ་དང་། རོལ་བ་དང་། ཁྲོ་བ་དང་། ང་རྒྱལ་དང་། ཕྲག་དོག་དང་། ཕྲ་མ་ལ་སོགས་པ་ཀུན་ཏུ་འབྱུང་བར་འགྱུར།
en: If there truly is no self in the body, then how do playfulness, laughter, crying, enjoyment, anger, pride, jealousy, calumny, and so forth come about?

source: ཅི་ལུས་ལ་ཡང་དག་པར་ན་བདག་ཡོད་དམ་མེད་པ་ཡིན།
en: Is there truly a self in the body or not?

source: བདག་ཅག་གི་ཐེ་ཚོམ་དེ་དག་ཁྱོད་ཀྱིས་བསལ་བའི་རིགས་སོ།
en: It would be proper for you to dispel our doubts.”

source: །ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། གྲོགས་པོ་དག་ལུས་ལ་ནི་བདག་ཡང་དག་པར་ཡོད་དོ་ཞེའམ། མེད་དོ་ཞེས་གཉི་གར་ཡང་འདིར་བརྗོད་པར་མི་བྱ་སྟེ། ཡང་དག་པར་ཡོད་དོ་ཞེས་བརྗོད་པ་ན་མེད་དོ་ཞེས་བརྗོད་པ་ནི་ལོག་པར་སྨྲ་བའོ།
en: The followers of the Mahāyāna replied, “Friends, it should not be said that there truly is or is not a self in the body, because to say in this case that there truly is or is not a self is mistaken speech.

source: །གལ་ཏེ་ཡོད་ན་ཇི་ལྟར་ན་དེ་སྐྲ་དང་། སེན་མོ་དང་། པགས་པ་དང་། མགོ་བོ་དང་། ཤ་དང་། རུས་པ་དང་། རྐང་དང་། ཚིལ་དང་། རྒྱུས་པ་དང་། མཆིན་པ་དང་། རྒྱུ་མ་དང་། མིད་པ་དང་། ལག་པ་དང་། རྐང་པ་དང་། ཡན་ལག་དང་། ཉིང་ལག་ལ་སོགས་པ་ལུས་ཐམས་ཅད་ཀྱི་ཕྱི་དང་ནང་དུ་བཅས་པ་ལ་རྣམ་པར་བརྟགས་ན་བདག་ཡང་དག་པར་མི་སྣང་ངོ་།
en: Now, if there were a self, then why is it not perceptible at all, even after searching through the hair, nails, skin, head, flesh, bones, marrow, fat, ligaments, liver, intestines, throat, hands, feet, limbs, and other minor parts, both inside and outside the body?”

source: །མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷའི་མིག་དང་ལྡན་པ་འགའ་ཞིག་གིས་མཐོང་གིས།
en: The tīrthikas said, “The self is only visible to those who have the divine eye.

source: བདག་ཅག་རྣམས་ནི་ཤའི་མིག་ཅན་ཡིན་པས་བདག་ཡང་དག་པར་ཇི་ལྟར་མཐོང་།
en: How could it be visible to us who only have eyes of flesh?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷའི་མིག་དང་ལྡན་པ་རྣམས་ཀྱིས་ཀྱང་མི་མཐོང་སྟེ།
en: The followers of the Mahāyāna replied, “It is not seen even by those with the divine eye.

source: གང་ལ་ཁ་དོག་མེད་པ་དང་། གཟུགས་མེད་པ་དང་། དབྱིབས་མེད་པ་དེ་ཇི་ལྟར་མཐོང་བར་འགྱུར།
en: For how can something that has no color, form, or shape be seen?”

source: མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། ཅི་མེད་པ་ཡིན་ནམ།
en: The tīrthikas asked, “Then is it nonexistent?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། མེད་དོ་ཞེས་བརྗོད་པ་ན་ཡོད་དོ་ཞེས་བརྗོད་པ་ནི་ལོག་པར་སྨྲ་བའོ།
en: The followers of the Mahāyāna said, “To say that it is nonexistent or to say that it is existent is mistaken speech.

source: །གལ་ཏེ་མེད་ན་ཇི་ལྟར་འདི་མངོན་སུམ་དུ་ཡོད་པར་རྩེ་བ་དང་། དགོད་པ་དང་། ངུ་བ་དང་། རོལ་བ་དང་། ཁྲོ་བ་དང་། ང་རྒྱལ་དང་། ཕྲག་དོག་དང་། ཕྲ་མ་ལ་སོགས་པ་ཀུན་ཏུ་འབྱུང་བར་འགྱུར།
en: If it is nonexistent, then why do playfulness, laughter, crying, enjoyment, anger, pride, jealousy, calumny, and so forth arise so clearly?

source: དེ་བས་ན་མེད་དོ་ཞེས་བརྗོད་པར་ཡང་མི་རུང་སྟེ།
en: Therefore, it is not correct to say that it is nonexistent.

source: ཡོད་དམ་མེད་ཅེས་གང་འདི་ལྟར་བརྗོད་པར་མི་བྱ་སྟེ།
en: One should not say that it is existent or nonexistent.

source: ཉེས་པ་འདི་ཡོད་པས་ན་ཡོད་པའོ་ཞེའམ། མེད་པའོ་ཞེས་བརྗོད་པར་མི་བྱའོ།
en: Since this would be a fault, one should not say that it exists or that it does not exist.”

source: །མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། འོ་ན་འདིར་གང་ཞིག་དམིགས་པར་འགྱུར།
en: The tīrthikas asked, “Then what is apprehended in this case?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། དམིགས་པར་གྱུར་པ་ནི་ཅི་ཡང་མེད་དོ།
en: The followers of the Mahāyāna said, “Nothing at all is apprehended.”

source: །མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། ཅི་ནམ་མཁའ་ལྟར་སྟོང་པ་ཉིད་ཡིན་ནམ།
en: The tīrthikas asked, “Is it as empty as the sky?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། གྲོགས་པོ་དག་དེ་དེ་བཞིན་ཏེ།
en: The followers of the Mahāyāna said, “Friends, it is exactly like that!

source: ནམ་མཁའ་ལྟར་སྟོང་པ་ཉིད་ཡིན་ནོ།
en: It is as empty as the sky.”

source: །མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟར་ཡིན་ན་རྩེ་བ་དང་། དགོད་པ་དང་། ངུ་བ་དང་། རོལ་པ་དང་། ཁྲོ་བ་དང་། ང་རྒྱལ་དང་། ཕྲག་དོག་དང་། ཕྲ་མ་ལ་སོགས་པ་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: The tīrthikas asked, “If that is so, then how should one view playfulness, laughter, crying, enjoyment, anger, pride, jealousy, calumny, and so forth?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། སྒྱུ་མ་དང་། རྨི་ལམ་དང་། མིག་འཕྲུལ་དང་འདྲ་བ་ཉིད་ཡིན་ནོ།
en: The followers of the Mahāyāna said, “They should be regarded as like an illusion, a dream, and a magical deception.”

source: །མུ་སྟེགས་པ་རྣམས་ཀྱིས་སྨྲས་པ། སྒྱུ་མ་ནི་ཇི་ལྟ་བུ་ལགས། རྨི་ལམ་དང་། མིག་འཕྲུལ་ནི་ཇི་ལྟ་བུ་ལགས།
en: The tīrthikas asked, “How are they like an illusion, a dream, and a magical deception?”

source: ཐེག་པ་ཆེན་པོ་པ་རྣམས་ཀྱིས་སྨྲས་པ། སྒྱུ་མ་ནི་མཚོན་པ་ཙམ་མོ།
en: The followers of the Mahāyāna said, “An illusion is a mere analogy.

source: །རྨི་ལམ་ནི་སོ་སོར་སྣང་བ་ཙམ་སྟེ། གཟུང་བར་བྱ་བ་མ་ཡིན་ཞིང་རང་བཞིན་གྱིས་སྟོང་པ། ཡོད་པ་མ་ཡིན་པའི་ངོ་བོ་ཉིད་དོ།
en: A dream is a mere appearance that is not graspable, empty by nature, and nonexistent in essence.

source: །མིག་འཕྲུལ་ནི་བཅོས་མ་ཙམ་དུ་དགོས་པའོ།
en: A magical deception is intentionally fabricated.

source: །གྲོགས་པོ་དག་དེ་དེ་བཞིན་ཏེ།
en: This is the way things are, friends.

source: དངོས་པོ་ཇི་སྙེད་པ་ཐམས་ཅད་ནི་སྒྱུ་མ་དང་། རྨི་ལམ་དང་། མིག་འཕྲུལ་དང་འདྲ་བར་ཤེས་པར་བྱའོ།
en: You should regard all these things as being like an illusion, a dream, and a magical deception.

source: །གཞན་ཡང་ཀུན་རྫོབ་དང་། དོན་དམ་པ་དག་བསྟན་པར་བྱ་སྟེ།
en: “Moreover, the distinction between the relative and the ultimate should be pointed out.

source: དེ་ལ་ཀུན་རྫོབ་ཅེས་བྱ་བ་ནི་འདི་ནི་བདག་གོ། །འདི་ནི་གཞན་ནོ་ཞེས་བྱ་བ་དང་། སྲོག་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ནོར་དང་། བུ་དང་། ཆུང་མ་དང་། མཛའ་བཤེས་དང་། ཉེ་དུ་ལ་སོགས་པར་རྟོག་པ་དེ་ནི་ཀུན་རྫོབ་ཅེས་བྱའོ།
en: In this regard, the relative consists in the conception ‘this is self, that is other.’ To conceptualize a soul, a person, an individual, an agent, an observer, wealth, children, wives, friends, relatives, and so forth is called the relative

source: །གང་ལ་བདག་མེད་པ་དང་། གཞན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། སྐྱེས་བུ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། བྱེད་པ་པོ་མེད་པ་དང་། ཚོར་བ་པོ་མེད་པ་དང་། ནོར་མེད་པ་དང་། བུ་མེད་པ་དང་། ཆུང་མ་མེད་པ་དང་། མཛའ་བཤེས་མེད་པ་དང་། ཉེ་དུ་ལ་སོགས་པ་མེད་པ་དེ་ནི་དོན་དམ་པ་ཞེས་བྱའོ། །གང་ལ་རང་བཞིན་གྱིས་དངོས་པོ་ཐམས་ཅད་དུ་ཡོངས་སུ་བརྟགས་ཤིང་དགེ་བ་དང་། མི་དགེ་བའི་འབྲས་བུ་དང་། སྐྱེ་བ་དང་། འགག་པ་ནི་ཀུན་རྫོབ་བོ།
en: “Where there is no self, no other, no soul, no person, no individual, no agent, no observer, no wealth, no children, no wives, no friends, no relatives, and so forth, this is called the ultimate . The relative consists in habitually labeling all things, in the results of virtuous and nonvirtuous deeds, and in birth and cessation.

source: །དགེ་བ་དང་མི་དགེ་བའི་འབྲས་བུ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དེ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་མེད་དེ། དེ་ནི་དབུ་མའི་ཆོས་རྣམས་ཀྱི་སྒྲུབ་པ་ལྷུར་ལེན་པའོ།
en: “The very essence of suchness, where there are no virtuous results, no nonvirtuous results, no birth, and no cessation, is beyond both pollution and purification. This is the middle way teaching to strive for in practice.

source: །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: In this regard, it is said:

source: ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ།
en: “Relative and ultimate

source: །དབྱེ་བ་གཉིས་སུ་ཡང་དག་བཤད།
en: Are explained as two categories:

source: །ཀུན་རྫོབ་འཇིག་རྟེན་པ་ཡི་ཆོས།
en: The relative comprises worldly phenomena;

source: །དོན་དམ་འཇིག་རྟེན་འདས་པའོ།
en: The ultimate is beyond the worldly.

source: །ཀུན་རྫོབ་ཆོས་ལ་ཞུགས་པ་ཡི།
en: “Engaging with relative phenomena,

source: །སེམས་ཅན་ཉོན་མོངས་དབང་དུ་འགྲོ།
en: Sentient beings are overpowered by emotional defilements.

source: །དོན་དམ་ཡོངས་སུ་མ་ཤེས་པས།
en: Not knowing the ultimate at all,

source: །འཁོར་བར་ཡུན་རིང་འཁོར་བར་འགྱུར།
en: They wander for a long time in saṃsāra. “The unwise form the concepts

source: །ཀུན་རྫོབ་འཇིག་རྟེན་ཆོས་རྣམས་ལ། །མི་མཁས་པ་དག་རྟོག་པར་བྱེད།
en: Of relative worldly phenomena.

source: །ཀུན་ཏུ་རྟོག་པ་དེ་ཡིས་ནི།
en: Due to such conceptualization,

source: །སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་འགྱུར།
en: They experience suffering.

source: །ཇི་ལྟར་སོ་སོའི་སྐྱེ་བོ་ཡི།
en: “Ordinary individuals, due to their immaturity,

source: །བྱིས་པས་གྲོལ་ལམ་མི་ཤེས་པས།
en: Do not know the path of liberation.

source: །མི་ཟད་པ་ཡི་སྡུག་བསྔལ་དག །མང་པོ་རྗེས་སུ་མྱོང་བར་འགྱུར།
en: They experience sundry forms Of unending suffering. “Oblivious to the ultimate,

source: །གང་དུ་སྲིད་པ་འགག་འགྱུར་བའི། །དོན་དམ་དག་ནི་མི་ཤེས་པས།
en: Where worldly existence ceases,

source: །སྐྱེ་བ་དང་ནི་འགག་འགྱུར་ཞིང་།
en: They are born and cease.

source: །སྐྱེ་མེད་འགྲོ་དང་འོང་བར་འགྱུར།
en: Although birthless, they come and go.

source: །འཇིག་རྟེན་ཆོས་ལ་གནས་པ་ཡི།
en: “Fools who dwell on worldly phenomena

source: །བླུན་པོ་འཁོར་ལོ་བཞིན་དུ་འཁོར།
en: Will rove around like a wheel.

source: །སྡུག་བསྔལ་གནས་ཅན་འཁོར་བ་འདིར།
en: In saṃsāra, the place of suffering,

source: །ཡང་དང་ཡང་དུ་འཁོར་བར་འགྱུར།
en: They will revolve again and again.

source: །ཇི་ལྟར་ཉི་མ་ཟླ་བ་དག །སླར་ཡང་འོང་ཞིང་འགྲོ་བར་བྱེད།
en: “Just as the sun and the moon Continue to come and go,

source: །དེ་བཞིན་སྲིད་པར་འཕོ་བ་ན།
en: Likewise, these beings, transmigrating in the world,

source: །སླར་ཡང་འོང་ཞིང་འགྲོ་བར་འགྱུར།
en: Come and go, again and again.

source: །འཁོར་བ་ཐམས་ཅད་མི་རྟག་ཅིང་།
en: “The whole of saṃsāra is impermanent and unstable,

source: །མི་བརྟན་སྐད་ཅིག་འཇིག་པ་ཉིད།
en: Disintegrating at every moment.

source: །དེ་བས་དོན་དམ་ཤེས་པ་ཡིས།
en: That is why, by knowing the ultimate,

source: །ཀུན་རྫོབ་བདེན་པའི་གནས་སྤོང་ངོ་།
en: One abandons the state of relative reality.

source: །མཐོ་རིས་གནས་ནས་ལྷ་རྣམས་དང་། །དྲི་ཟ་ལྷ་མི་རྣམས་ཀྱང་ནི།
en: “Devas from the higher realms, As well as gandharvas, apsarases, and humans,

source: །ཀུན་ལ་འཕོ་བ་ཡོད་གྱུར་པ།
en: Are all subject to transmigration—

source: །ཀུན་ཀྱང་ཀུན་རྫོབ་འབྲས་བུ་ཡིན།
en: All this is the result of the relative.

source: །གྲུབ་དང་རིགས་འཛིན་གནོད་སྦྱིན་དང་། །དྲི་ཟ་དང་ནི་ལྟོ་འཕྱེ་རྣམས།
en: “Siddhas, vidyādharas, and yakṣas, Gandharvas and mahoragas,

source: །སླར་ཡང་དམྱལ་བར་འགྲོ་འགྱུར་བ།
en: Go again and again to hell—

source: །གང་ཞིག་བརྩོན་དྲག་ལྷ་རྣམས་དང་། །ཡོན་ཏན་འབྱུང་གནས་ལ་གནས་གང་།
en: In the abode of the devas due to good qualities

source: །མཐོ་རིས་ལས་འཕོ་ལྟུང་གྱུར་པ།
en: Must again pass away and fall from the higher realms—

source: །ཐམས་ཅད་ཀུན་རྫོབ་འབྲས་བུ་ཡིན། །བརྒྱ་བྱིན་འཁོར་ལོས་སྒྱུར་ཉིད་དེ།
en: All this is the result of the relative.

source: །གང་གིས་དམ་པའི་གནས་ཐོབ་ནས།
en: “Whoever attains the supreme state Of Śakra or of a universal monarch

source: །སླར་ཡང་བྱོལ་སོང་སྐྱེ་གནས་འཇུག །ཐམས་ཅད་ཀུན་རྫོབ་འབྲས་བུ་ཡིན།
en: Will once again enter the birthplace of animals— All this is the result of the relative. “Abandoning the great bliss

source: །དེ་བས་མཐོ་རིས་ལྷ་རྣམས་ཀྱི། །བདེན་པ་བཟང་པོ་ཀུན་སྤོང་ལ།
en: Of the devas of the higher realms,

source: །བྱང་ཆུབ་སེམས་ནི་འོད་གསལ་བ། །རྣལ་འབྱོར་པས་ནི་རྟག་ཏུ་བསྒོམ།
en: A yogin should always meditate On the mind of awakening, which is luminosity.

source: །དངོས་པོ་མེད་ཅིང་དམིགས་སུ་མེད།
en: “Essenceless, unapprehendable,

source: །ཐམས་ཅད་སྟོང་པ་གནས་མེད་པ།
en: Entirely empty, groundless,

source: །སྤྲོས་པ་རྣམས་ལས་ཡང་དག་འདས།
en: And beyond all conceptual elaboration—

source: །བྱང་ཆུབ་སེམས་དཔའི་མཚན་ཉིད་ཡིན།
en: Such is the definition of the mind of awakening.

source: །སྲ་བ་མ་ཡིན་འཇམ་པ་མིན།
en: “Neither hard nor soft,

source: །དྲོ་བ་མ་ཡིན་གྲང་བ་མིན།
en: Neither warm nor cold,

source: །དེ་ནི་རེག་མིན་གཟུང་བྱ་མིན།
en: Neither tangible nor graspable—

source: །བྱང་ཆུབ་སེམས་ཀྱི་མཚན་ཉིད་ཡིན།
en: Such is the definition of the mind of awakening.

source: །རིང་པོ་མ་ཡིན་ཐུང་བ་མིན།
en: “Neither long nor short,

source: །ཟླུམ་པོ་མ་ཡིན་གྲུ་གསུམ་མིན།
en: Neither round nor triangular,

source: །ཕྲ་བ་མ་ཡིན་སྦོམ་པའང་མིན།
en: Neither thin nor thick—

source: །སྒོམ་པ་རྣམས་ལས་རྣམ་འདས་ཤིང་།
en: “Beyond meditation,

source: །མུ་སྟེགས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་མིན།
en: Out of range for tīrthikas,

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་སྦྱོར་བ།
en: And having the perfection of insight as its practice

source: །དཔེ་མེད་བསྒོམ་དུ་མེད་པ་དང་། །མཐོང་མིན་གནས་ཀྱི་མཆོག་གྱུར་ལ།
en: “Beyond analogy, it is nothing to meditate on. The supreme unseen abode,

source: །རང་བཞིན་གྱིས་ནི་རྣམ་དག་པ།
en: Completely pure by nature—

source: །ཐམས་ཅད་དབུ་བ་ལྟ་བུ་སྟེ།
en: “All things are like foam,

source: །ཆུ་བུར་ལྟ་བུར་སྙིང་པོ་མེད།
en: Essenceless like water bubbles,

source: །རྟག་པ་མ་ཡིན་བདག་མེད་པ།
en: Neither permanent nor having self.

source: །སྒྱུ་མ་སྨིག་རྒྱུ་དག་དང་མཚུངས།
en: They are similar to magical illusions and mirages.

source: །གོང་བུ་བཞིན་དུ་བསྡུས་གྱུར་པ།
en: “Like a vase that is made from a lump of clay,

source: །སྤྲོས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་གང་།
en: Beings are filled with conceptual elaborations‍—

source: །འདོད་ཆགས་ཞེ་སྡང་ལ་སོགས་ལྟར།
en: Desire, anger, and so forth‍—

source: །དེ་ནི་སྒྱུ་མཚུངས་འབའ་ཞིག་ཡིན།
en: They are utterly illusion-like.

source: །ཇི་ལྟར་ནང་ན་ཐིག་ལེ་ནི།
en: “Just as in the morning where there was a dew drop

source: །སྐད་ཅིག་དེ་ལ་མི་མཐོང་སྟེ།
en: A moment later there is nothing to be seen,

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་མཐོང་ན།
en: So, too, when one sees the perfection of insight

source: །དེ་བཞིན་བློ་ནི་འདུས་མ་བྱས།
en: The intellect gives way to the unconditioned.

source: །རྟག་ཏུ་དགོད་ཅིང་རྩེ་བ་དང་། །སྨྲ་ཞིང་གླུ་དང་རོལ་མོ་དང་། །གཞི་ལ་སོགས་པའི་བདེ་བ་རྣམས།
en: “Continuous laughter and play, Talking, singing, music, The enjoyment of material things, and so forth

source: །དེ་དག་ཐམས་ཅད་རྨི་ལམ་མཚུངས།
en: Are all similar to dreams.

source: །ལུས་ཅན་ཀུན་གྱིས་འདུས་བྱས་པ།
en: “Things constructed by beings

source: །འདི་ཀུན་རྨི་ལམ་དང་མཚུངས་ལ།
en: Are all similar to dreams.

source: །རྨི་ལམ་སེམས་ཀྱི་ཀུན་རྟོག་སྟེ།
en: Dreams are imaginings of the mind.

source: །སེམས་ཀྱང་ནམ་མཁའ་ལྟ་བུ་ཡིན།
en: Mind itself is like the sky.

source: །གང་ཞིག་ཚུལ་འདི་རྟག་སྒོམ་པ།
en: “One who constantly meditates

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་པའི་ཚུལ། །གང་ཞིག་འདི་ནི་རྟག་སྒོམ་པ།
en: On this way of the perfection of insight

source: །དངོས་པོ་ཀུན་ལས་རྣམ་གྲོལ་ནས།
en: Becomes free of all entities

source: །གོ་འཕང་མཆོག་ནི་ཐོབ་པར་འགྱུར།
en: And attains the supreme state. “Those who uphold, with meditation,

source: །བླ་ན་མེད་པའི་བྱང་ཆུབ་གང་།
en: The highest awakening

source: །སངས་རྒྱས་ཀུན་གྱིས་རྣམ་བསྒོམ་པ། །བསྒོམས་དང་བཅས་པས་འཛིན་ན་ནི།
en: Cultivated by all the buddhas

source: །ཐེག་ཆེན་འབྲས་བུ་འཐོབ་པར་འགྱུར།
en: Will gain the fruit of the Mahāyāna.”

source: །འཕགས་པ་བདག་མེད་པ་དྲིས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: Here ends the noble Mahāyāna sūtra “Questions on Selflessness.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཀ་མ་ལ་གུབ་ཏ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་དགེ་སློང་རིན་ཆེན་བཟང་པོས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Translated, edited, and finalized by the Indian preceptor Kamalagupta and the great Tibetan editor-translator Bhikṣu Rinchen Sangpo.
